# Machine Learning Foundation

## Section 1, Part b: Reading Data Lab

In [1]:
# Imports
import sqlite3 as sq3
import pandas.io.sql as pds
import pandas as pd

## Lab Exercise: Reading in database files

 - Create a variable, `path`, containing the path to the `baseball.db` contained in `resources/`
 - Create a connection, `con`, that is connected to database at `path`
 - Create a variable, `query`, containing a SQL query which reads in all data from the `allstarfull` table
 - Create a variable, `observations`, by using pandas' [read_sql](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_sql.html)

### Optional
 - Create a variable, `tables`, which reads in all data from the table `sqlite_master`
 - Pretend that you were interesting in creating a new baseball hall of fame. Join and analyze the tables to evaluate the top 3 all time best baseball players.

In [2]:
# Create a variable, path, containing the path to the baseball.db contained in resources/
path = 'data/baseball.db'

# Create a connection, con, that is connected to database at path
con = sq3.Connection(path)

In [3]:
# Create a variable, query, containing a SQL query which reads in all data from the allstarfull table
query1 = """
SELECT *
FROM allstarfull;
"""

# Create a variable, observations, by using pandas' read_sql
observations = pds.read_sql(query1, con)
observations.head()

,index,playerID,yearID,gameNum,gameID,teamID,lgID,GP,startingPos
0,0,gomezle01,1933,0,ALS193307060,NYA,AL,1.0,1.0
1,1,ferreri01,1933,0,ALS193307060,BOS,AL,1.0,2.0
2,2,gehrilo01,1933,0,ALS193307060,NYA,AL,1.0,3.0
3,3,gehrich01,1933,0,ALS193307060,DET,AL,1.0,4.0
4,4,dykesji01,1933,0,ALS193307060,CHA,AL,1.0,5.0

In [4]:
# Create a variable, tables, which reads in all data from the table sqlite_master
query2 = """
SELECT *
FROM sqlite_master;
"""

tables = pds.read_sql(query2, con)
tables

,type,name,tbl_name,rootpage,sql
0,table,allstarfull,allstarfull,2,"CREATE TABLE ""allstarfull"" (\n""index"" INTEGER,..."
1,index,ix_allstarfull_index,allstarfull,3,"CREATE INDEX ""ix_allstarfull_index""ON ""allstar..."
2,table,schools,schools,26,"CREATE TABLE ""schools"" (\n""index"" INTEGER,\n ..."
3,index,ix_schools_index,schools,31,"CREATE INDEX ""ix_schools_index""ON ""schools"" (""..."
4,table,batting,batting,99,"CREATE TABLE ""batting"" (\n""index"" INTEGER,\n ..."
5,index,ix_batting_index,batting,100,"CREATE INDEX ""ix_batting_index""ON ""batting"" (""..."

In [5]:
pds.read_sql('SELECT * FROM schools', con).head()

   index    schoolID                     name_full         city state country
0      0  abilchrist  Abilene Christian University      Abilene    TX     USA
1      1     adelphi            Adelphi University  Garden City    NY     USA
2      2    adrianmi                Adrian College       Adrian    MI     USA
3      3       akron           University of Akron        Akron    OH     USA
4      4     alabama         University of Alabama   Tuscaloosa    AL     USA

In [6]:
pds.read_sql('SELECT * FROM batting', con).head()

,index,playerID,yearID,stint,teamID,lgID,G,AB,R,H,...,RBI,SB,CS,BB,SO,IBB,HBP,SH,SF,GIDP
0,0,abercda01,1871,1,TRO,None,1,4,0,0,...,0.0,0.0,0.0,0,0.0,NaN,NaN,NaN,NaN,NaN
1,1,addybo01,1871,1,RC1,None,25,118,30,32,...,13.0,8.0,1.0,4,0.0,NaN,NaN,NaN,NaN,NaN
2,2,allisar01,1871,1,CL1,None,29,137,28,40,...,19.0,3.0,1.0,2,5.0,NaN,NaN,NaN,NaN,NaN
3,3,allisdo01,1871,1,WS3,None,27,133,28,44,...,27.0,1.0,1.0,0,2.0,NaN,NaN,NaN,NaN,NaN
4,4,ansonca01,1871,1,RC1,None,25,120,29,39,...,16.0,6.0,2.0,2,1.0,NaN,NaN,NaN,NaN,NaN

In [7]:
# Pretend that you were interesting in creating a new baseball hall of fame.
# Join and analyze the tables to evaluate the top 3 all time best baseball players
query3 = """
SELECT playerID,
       SUM(GP) AS num_games_played,
       AVG(startingPos) AS avg_starting_position
FROM allstarfull
GROUP BY playerID
ORDER BY num_games_played DESC, avg_starting_position ASC
LIMIT 3
"""

best_players = pd.read_sql(query3, con)
print(best_players)

    playerID  num_games_played  avg_starting_position
0  musiast01              24.0               6.357143
1   mayswi01              24.0               8.000000
2  aaronha01              24.0               8.470588

---
### Machine Learning Foundation (C) 2020 IBM Corporation